# InfillCannotChangeType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InfillCannotChangeType Property
BuiltInFailures..::..InfillFailures Class See Also
---
Infilling element replaced by a later phase insert must be the same type as the insert's host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InfillCannotChangeType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfillCannotChangeType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InfillCannotChangeType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace